from main import *

player = make_hero(
    name="Вася Питонов",
    hp_now=100,
    money=9999999999999999999,
    inventory=[
        {
            "тип": "оружие",
            "название": "Супер меч",
            "свойство": "атака",
            "модификатор": 5,
            "цена": 200,
        },
        {
            "тип": "щит",
            "название": "Кибербогатырский щит",
            "свойство": "защита",
            "модификатор": 3,
            "цена": 150,
        },
        {
            "тип": "продукт",
            "название": "зелье хила",
            "свойство": "здоровье",
            "модификатор": 10,
            "цена": 350,
        },
    ],
)
recalculate_stats(player)

game = True
while game:
    visit_hub(player)
